App({
  globalData: {
    faculties: ['人文学院', '新闻传播学院', '外文学院', '经济学院', '王亚南经济研究院', '管理学院', '财务管理与会计研究院', '法学院', '知识产权研究院', '公共事务学院', '艺术学院', '海外教育学院/国际学院', '国际关系学院/南洋研究院', '数学科学学院', '物理科学与技术学院', '化学化工学院', '材料学院', '生命科学学院', '海洋与地球学院', '环境与生态学院', '建筑与土木工程学院', '医学院', '药学院', '公共卫生学院', '能源学院', '航空航天学院', '电子科学与技术学院', '社会与人类学院', '信息学院', '创意与创新学院'],
    courseTypes: ['体育', '大学英语', '专业必修', '院选', '校选']
  },

  onLaunch() {
    console.log("Launching App")
  },

  onShow() {
    console.log("Showing App")
  }
})